[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:118:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateRequested && "Request Date is required"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Request Date is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:118:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateRequested && "Request Date is required"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Request Date is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:138:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateNeeded && "Date Needed is required"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:138:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateNeeded && "Date Needed is required"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
