[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:52:5
       Header: "Explanation",
       accessor: "explanation",
     },
-    {
-      Header: "Request Date",
-      accessor: "dateRequested",
-    },
+    {},
     {
       Header: "Date Needed",
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:53:15
       accessor: "explanation",
     },
     {
-      Header: "Request Date",
+      Header: "",
       accessor: "dateRequested",
     },
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Request Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
