[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:36:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    data.done = data.done === "true";
-    mutation.mutate(data);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess && !storybook) {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend, done = false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:37:17
   const { isSuccess } = mutation;
 
   const onSubmit = async (data) => {
-    data.done = data.done === "true";
+    data.done = true;
     mutation.mutate(data);
   };
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend, done = false
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "dateNeeded": "2022-02-02T00:00",
    "dateRequested": "2022-02-02T00:00",

[Killed] EqualityOperator
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:37:17
   const { isSuccess } = mutation;
 
   const onSubmit = async (data) => {
-    data.done = data.done === "true";
+    data.done = data.done !== "true";
     mutation.mutate(data);
   };
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend, done = false
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "dateNeeded": "2022-02-02T00:00",
    "dateRequested": "2022-02-02T00:00",
