[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:45:11
   });
 
   const onSuccess = (recommendationRequest) => {
-    toast(`Recommendation Request Updated - id: ${recommendationRequest.id}`);
+    toast(``);
   };
 
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Recommendation Request Updated - id: 17"
Received: ""

Number of calls: 1
