[Killed] ObjectLiteral
main/components/RequestType/RequestTypeForm.js:67:24
           isInvalid={Boolean(errors.requestType)}
           {...register("requestType", {
             required: "Request Type is required.",
-            maxLength: {
-              value: 100,
-              message: "Max length 100 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: RequestTypeForm tests that the correct validations are performed
statusReason: TypeError: e is not a function
