[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/request-types/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RequestTypeTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/request-types/edit/2"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/request-types/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: RequestTypeTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/request-types/edit/2"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style
