[Killed] ArrowFunction
main/pages/RequestType/RequestTypeCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function RequestTypeCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (requestType) => ({
-    url: "/api/request-types/post",
-    method: "POST",
-    params: {
-      description: requestType.requestType,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (requestType) => {
killedBy: RequestTypeCreatePage tests on submit, makes request to backend, and redirects to /requesttypes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/RequestType/RequestTypeCreatePage.js:10:13
 export default function RequestTypeCreatePage({ storybook = false }) {
   const objectToAxiosParams = (requestType) => ({
     url: "/api/request-types/post",
-    method: "POST",
+    method: "",
     params: {
       description: requestType.requestType,
killedBy: RequestTypeCreatePage tests on submit, makes request to backend, and redirects to /requesttypes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/RequestType/RequestTypeCreatePage.js:16:38
     },
   });
 
-  const onSuccess = (requestType) => {
-    toast(
-      `New Request Type Created - id: ${requestType.id} requestType: ${requestType.requestType}`,
-    );
-  };
+  const onSuccess = (requestType) => {};
 
   const mutation = useBackendMutation(
killedBy: RequestTypeCreatePage tests on submit, makes request to backend, and redirects to /requesttypes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Request Type Created - id: 1 requestType: Scholarship or Fellowship"

Number of calls: 0

[Killed] BlockStatement
main/pages/RequestType/RequestTypeCreatePage.js:35:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/requesttype" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: RequestTypeCreatePage tests on submit, makes request to backend, and redirects to /requesttypes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/requesttype"}

Number of calls: 0
