[Killed] BlockStatement
src/main/utils/requestTypeUtils.js:7:42
  * Function to handle success message after deleting a request type.
  * @param {string} message - The success message to display.
  */
-export function onDeleteSuccess(message) {
-  console.log(message);
-  toast(message);
-}
+export function onDeleteSuccess(message) {}
 
 /**
killedBy: requestTypeUtils onDeleteSuccess It puts the message on console.log and in a toast
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Request Type deleted successfully"

Number of calls: 0

[Killed] BlockStatement
src/main/utils/requestTypeUtils.js:17:47
  * @param {object} cell - The table cell containing the request type data.
  * @returns {object} Axios parameters for the DELETE request.
  */
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/request-types",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: RequestTypeTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
